def area(a):
    """
    Вычисляет площадь квадрата по длине его стороны.

        Параметры:
                a (число): длина стороны квадрата

        Возвращаемое значение:
                area_of_square (число): площадь квадрата
    """

    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата по длине его стороны.

        Параметры:
                a (число): длина стороны квадрата

        Возвращаемое значение:
                perimeter_of_square (число): периметр квадрата
    """

    return 4 * a
